[Survived] String mutation
Service/Exceptions/ChasseurInconnu.cs:6:20
     public class ChasseurInconnu : Exception
     {
         public ChasseurInconnu(string chasseur)
-            : base($"Chasseur inconnu {chasseur}")
+            : base($"")
         {
         }
