[Killed] Block removal mutation
Service/PartieDeChasseService.cs:15:9
         public PartieDeChasseService(
             IPartieDeChasseRepository repository,
             Func<DateTime> timeProvider)
-        {
-            _repository = repository;
-            _timeProvider = timeProvider;
-        }
+        {}
 
         public Guid Demarrer((string nom, int nbGalinettes) terrainDeChasse, List<(string nom, int nbBalles)> chasseurs)
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+ReprendreLaPartieDeChasse.EchoueCarPartieNexistePas; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+ReprendreLaPartieDeChasse.EchoueSiLaChasseEstEnCours; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+ReprendreLaPartieDeChasse.EchoueSiLaPartieDeChasseEstTerminée

[Killed] Equality mutation
Service/PartieDeChasseService.cs:22:17
 
         public Guid Demarrer((string nom, int nbGalinettes) terrainDeChasse, List<(string nom, int nbBalles)> chasseurs)
         {
-            if (terrainDeChasse.nbGalinettes <= 0)
+            if (terrainDeChasse.nbGalinettes > 0)
             {
                 throw new ImpossibleDeDémarrerUnePartieSansGalinettes();
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.AvecPlusieursChasseurs; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.EchoueAvecUnTerrainSansGalinettes; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.EchoueSiChasseurSansBalle

[Killed] Negate expression
Service/PartieDeChasseService.cs:22:17
 
         public Guid Demarrer((string nom, int nbGalinettes) terrainDeChasse, List<(string nom, int nbBalles)> chasseurs)
         {
-            if (terrainDeChasse.nbGalinettes <= 0)
+            if (!(terrainDeChasse.nbGalinettes <= 0))
             {
                 throw new ImpossibleDeDémarrerUnePartieSansGalinettes();
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.AvecPlusieursChasseurs; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.EchoueAvecUnTerrainSansGalinettes; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.EchoueSiChasseurSansBalle

[Killed] Statement mutation
Service/PartieDeChasseService.cs:24:17
         {
             if (terrainDeChasse.nbGalinettes <= 0)
             {
-                throw new ImpossibleDeDémarrerUnePartieSansGalinettes();
+                ;
             }
 
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.EchoueAvecUnTerrainSansGalinettes

[Killed] Object initializer mutation
Service/PartieDeChasseService.cs:27:34
                 throw new ImpossibleDeDémarrerUnePartieSansGalinettes();
             }
 
-            var partieDeChasse = new PartieDeChasse()
-            {
-                Id = Guid.NewGuid(),
-                Status = PartieStatus.EnCours,
-                Chasseurs = new List<Chasseur>(),
-                Terrain = new Terrain
-                {
-                    Nom = terrainDeChasse.nom,
-                    NbGalinettes = terrainDeChasse.nbGalinettes
-                },
-                Events = new List<Event>()
-            };
+            var partieDeChasse = new PartieDeChasse()
+{};
 
             foreach (var chasseur in chasseurs)
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.AvecPlusieursChasseurs; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.EchoueSiChasseurSansBalle; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.EchoueSansChasseurs

[Killed] Equality mutation
Service/PartieDeChasseService.cs:42:21
 
             foreach (var chasseur in chasseurs)
             {
-                if (chasseur.nbBalles == 0)
+                if (chasseur.nbBalles != 0)
                 {
                     throw new ImpossibleDeDémarrerUnePartieAvecUnChasseurSansBalle();
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.AvecPlusieursChasseurs; Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Killed] Statement mutation
Service/PartieDeChasseService.cs:44:21
             {
                 if (chasseur.nbBalles == 0)
                 {
-                    throw new ImpossibleDeDémarrerUnePartieAvecUnChasseurSansBalle();
+                    ;
                 }
 
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.EchoueSiChasseurSansBalle

[Killed] Object initializer mutation
Service/PartieDeChasseService.cs:47:46
                     throw new ImpossibleDeDémarrerUnePartieAvecUnChasseurSansBalle();
                 }
 
-                partieDeChasse.Chasseurs.Add(new Chasseur
-                {
-                    Nom = chasseur.nom,
-                    BallesRestantes = chasseur.nbBalles
-                });
+                partieDeChasse.Chasseurs.Add(new Chasseur
+{});
             }
 
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.AvecPlusieursChasseurs; Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Killed] Equality mutation
Service/PartieDeChasseService.cs:54:17
                 });
             }
 
-            if (partieDeChasse.Chasseurs.Count == 0)
+            if (partieDeChasse.Chasseurs.Count != 0)
             {
                 throw new ImpossibleDeDémarrerUnePartieSansChasseur();
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.AvecPlusieursChasseurs; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.EchoueSansChasseurs; Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Killed] Statement mutation
Service/PartieDeChasseService.cs:56:17
 
             if (partieDeChasse.Chasseurs.Count == 0)
             {
-                throw new ImpossibleDeDémarrerUnePartieSansChasseur();
+                ;
             }
 
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.EchoueSansChasseurs

[Killed] Statement mutation
Service/PartieDeChasseService.cs:64:13
                 partieDeChasse.Chasseurs.Select(c => c.Nom + $" ({c.BallesRestantes} balles)")
             );
 
-            partieDeChasse.Events.Add(new Event(_timeProvider(),
-                $"La partie de chasse commence à {partieDeChasse.Terrain.Nom} avec {chasseursToString}")
-            );
+            ;
 
             _repository.Save(partieDeChasse);
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Killed] Statement mutation
Service/PartieDeChasseService.cs:68:13
                 $"La partie de chasse commence à {partieDeChasse.Terrain.Nom} avec {chasseursToString}")
             );
 
-            _repository.Save(partieDeChasse);
+            ;
 
             return partieDeChasse.Id;
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+DemarrerUnePartieDeChasse.AvecPlusieursChasseurs; Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Killed] Equality mutation
Service/PartieDeChasseService.cs:77:17
         {
             var partieDeChasse = _repository.GetById(id);
 
-            if (partieDeChasse == null)
+            if (partieDeChasse != null)
             {
                 throw new LaPartieDeChasseNexistePas();
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.EchoueSiLesChasseursSontEnApero; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.AvecUnChasseurAyantDesBallesEtAssezDeGalinettesSurLeTerrain

[Killed] Statement mutation
Service/PartieDeChasseService.cs:79:17
 
             if (partieDeChasse == null)
             {
-                throw new LaPartieDeChasseNexistePas();
+                ;
             }
 
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.EchoueCarPartieNexistePas

[Killed] Equality mutation
Service/PartieDeChasseService.cs:82:17
                 throw new LaPartieDeChasseNexistePas();
             }
 
-            if (partieDeChasse.Terrain.NbGalinettes != 0)
+            if (partieDeChasse.Terrain.NbGalinettes == 0)
             {
                 if (partieDeChasse.Status != PartieStatus.Apéro)
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.EchoueSiLesChasseursSontEnApero; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.AvecUnChasseurAyantDesBallesEtAssezDeGalinettesSurLeTerrain

[Killed] Equality mutation
Service/PartieDeChasseService.cs:84:21
 
             if (partieDeChasse.Terrain.NbGalinettes != 0)
             {
-                if (partieDeChasse.Status != PartieStatus.Apéro)
+                if (partieDeChasse.Status == PartieStatus.Apéro)
                 {
                     if (partieDeChasse.Status != PartieStatus.Terminée)
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.EchoueSiLesChasseursSontEnApero; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.AvecUnChasseurAyantDesBallesEtAssezDeGalinettesSurLeTerrain

[Killed] Equality mutation
Service/PartieDeChasseService.cs:86:25
             {
                 if (partieDeChasse.Status != PartieStatus.Apéro)
                 {
-                    if (partieDeChasse.Status != PartieStatus.Terminée)
+                    if (partieDeChasse.Status == PartieStatus.Terminée)
                     {
                         if (partieDeChasse.Chasseurs.Exists(c => c.Nom == chasseur))
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.AvecUnChasseurAyantDesBallesEtAssezDeGalinettesSurLeTerrain; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.EchoueAvecUnChasseurNayantPlusDeBalles

[Killed] Equality mutation
Service/PartieDeChasseService.cs:88:66
                 {
                     if (partieDeChasse.Status != PartieStatus.Terminée)
                     {
-                        if (partieDeChasse.Chasseurs.Exists(c => c.Nom == chasseur))
+                        if (partieDeChasse.Chasseurs.Exists(c => c.Nom != chasseur))
                         {
                             var chasseurQuiTire = partieDeChasse.Chasseurs.First(c => c.Nom == chasseur);
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.EchoueCarLeChasseurNestPasDansLaPartie

[Killed] Negate expression
Service/PartieDeChasseService.cs:88:29
                 {
                     if (partieDeChasse.Status != PartieStatus.Terminée)
                     {
-                        if (partieDeChasse.Chasseurs.Exists(c => c.Nom == chasseur))
+                        if (!(partieDeChasse.Chasseurs.Exists(c => c.Nom == chasseur)))
                         {
                             var chasseurQuiTire = partieDeChasse.Chasseurs.First(c => c.Nom == chasseur);
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.AvecUnChasseurAyantDesBallesEtAssezDeGalinettesSurLeTerrain; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.EchoueAvecUnChasseurNayantPlusDeBalles

[Killed] Equality mutation
Service/PartieDeChasseService.cs:90:87
                     {
                         if (partieDeChasse.Chasseurs.Exists(c => c.Nom == chasseur))
                         {
-                            var chasseurQuiTire = partieDeChasse.Chasseurs.First(c => c.Nom == chasseur);
+                            var chasseurQuiTire = partieDeChasse.Chasseurs.First(c => c.Nom != chasseur);
 
                             if (chasseurQuiTire.BallesRestantes == 0)
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.AvecUnChasseurAyantDesBallesEtAssezDeGalinettesSurLeTerrain; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.EchoueAvecUnChasseurNayantPlusDeBalles

[Survived] Linq method mutation (First() to FirstOrDefault())
Service/PartieDeChasseService.cs:90:51
                     {
                         if (partieDeChasse.Chasseurs.Exists(c => c.Nom == chasseur))
                         {
-                            var chasseurQuiTire = partieDeChasse.Chasseurs.First(c => c.Nom == chasseur);
+                            var chasseurQuiTire = partieDeChasse.Chasseurs.FirstOrDefault(c => c.Nom == chasseur);
 
                             if (chasseurQuiTire.BallesRestantes == 0)

[Killed] Equality mutation
Service/PartieDeChasseService.cs:92:33
                         {
                             var chasseurQuiTire = partieDeChasse.Chasseurs.First(c => c.Nom == chasseur);
 
-                            if (chasseurQuiTire.BallesRestantes == 0)
+                            if (chasseurQuiTire.BallesRestantes != 0)
                             {
                                 partieDeChasse.Events.Add(new Event(_timeProvider(),
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.AvecUnChasseurAyantDesBallesEtAssezDeGalinettesSurLeTerrain; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.EchoueAvecUnChasseurNayantPlusDeBalles

[Survived] Statement mutation
Service/PartieDeChasseService.cs:94:33
 
                             if (chasseurQuiTire.BallesRestantes == 0)
                             {
-                                partieDeChasse.Events.Add(new Event(_timeProvider(),
-                                    $"{chasseur} veut tirer sur une galinette -> T'as plus de balles mon vieux, chasse à la main"));
+                                ;
                                 _repository.Save(partieDeChasse);
 

[Survived] Statement mutation
Service/PartieDeChasseService.cs:96:33
                             {
                                 partieDeChasse.Events.Add(new Event(_timeProvider(),
                                     $"{chasseur} veut tirer sur une galinette -> T'as plus de balles mon vieux, chasse à la main"));
-                                _repository.Save(partieDeChasse);
+                                ;
 
                                 throw new TasPlusDeBallesMonVieuxChasseALaMain();

[Killed] Statement mutation
Service/PartieDeChasseService.cs:98:33
                                     $"{chasseur} veut tirer sur une galinette -> T'as plus de balles mon vieux, chasse à la main"));
                                 _repository.Save(partieDeChasse);
 
-                                throw new TasPlusDeBallesMonVieuxChasseALaMain();
+                                ;
                             }
 
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.EchoueAvecUnChasseurNayantPlusDeBalles

[Killed] PostDecrementExpression to PostIncrementExpression mutation
Service/PartieDeChasseService.cs:101:29
                                 throw new TasPlusDeBallesMonVieuxChasseALaMain();
                             }
 
-                            chasseurQuiTire.BallesRestantes--;
+                            chasseurQuiTire.BallesRestantes++;
                             chasseurQuiTire.NbGalinettes++;
                             partieDeChasse.Terrain.NbGalinettes--;
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.AvecUnChasseurAyantDesBallesEtAssezDeGalinettesSurLeTerrain

[Killed] Statement mutation
Service/PartieDeChasseService.cs:101:29
                                 throw new TasPlusDeBallesMonVieuxChasseALaMain();
                             }
 
-                            chasseurQuiTire.BallesRestantes--;
+                            ;
                             chasseurQuiTire.NbGalinettes++;
                             partieDeChasse.Terrain.NbGalinettes--;
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.AvecUnChasseurAyantDesBallesEtAssezDeGalinettesSurLeTerrain

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Service/PartieDeChasseService.cs:102:29
                             }
 
                             chasseurQuiTire.BallesRestantes--;
-                            chasseurQuiTire.NbGalinettes++;
+                            chasseurQuiTire.NbGalinettes--;
                             partieDeChasse.Terrain.NbGalinettes--;
                             partieDeChasse.Events.Add(new Event(_timeProvider(), $"{chasseur} tire sur une galinette"));
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.AvecUnChasseurAyantDesBallesEtAssezDeGalinettesSurLeTerrain

[Killed] Statement mutation
Service/PartieDeChasseService.cs:102:29
                             }
 
                             chasseurQuiTire.BallesRestantes--;
-                            chasseurQuiTire.NbGalinettes++;
+                            ;
                             partieDeChasse.Terrain.NbGalinettes--;
                             partieDeChasse.Events.Add(new Event(_timeProvider(), $"{chasseur} tire sur une galinette"));
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.AvecUnChasseurAyantDesBallesEtAssezDeGalinettesSurLeTerrain

[Killed] Statement mutation
Service/PartieDeChasseService.cs:103:29
 
                             chasseurQuiTire.BallesRestantes--;
                             chasseurQuiTire.NbGalinettes++;
-                            partieDeChasse.Terrain.NbGalinettes--;
+                            ;
                             partieDeChasse.Events.Add(new Event(_timeProvider(), $"{chasseur} tire sur une galinette"));
                         }
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.AvecUnChasseurAyantDesBallesEtAssezDeGalinettesSurLeTerrain

[Killed] PostDecrementExpression to PostIncrementExpression mutation
Service/PartieDeChasseService.cs:103:29
 
                             chasseurQuiTire.BallesRestantes--;
                             chasseurQuiTire.NbGalinettes++;
-                            partieDeChasse.Terrain.NbGalinettes--;
+                            partieDeChasse.Terrain.NbGalinettes++;
                             partieDeChasse.Events.Add(new Event(_timeProvider(), $"{chasseur} tire sur une galinette"));
                         }
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.AvecUnChasseurAyantDesBallesEtAssezDeGalinettesSurLeTerrain

[Killed] Statement mutation
Service/PartieDeChasseService.cs:104:29
                             chasseurQuiTire.BallesRestantes--;
                             chasseurQuiTire.NbGalinettes++;
                             partieDeChasse.Terrain.NbGalinettes--;
-                            partieDeChasse.Events.Add(new Event(_timeProvider(), $"{chasseur} tire sur une galinette"));
+                            ;
                         }
                         else
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Killed] Statement mutation
Service/PartieDeChasseService.cs:108:29
                         }
                         else
                         {
-                            throw new ChasseurInconnu(chasseur);
+                            ;
                         }
                     }
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.EchoueCarLeChasseurNestPasDansLaPartie

[Survived] Statement mutation
Service/PartieDeChasseService.cs:113:25
                     }
                     else
                     {
-                        partieDeChasse.Events.Add(new Event(_timeProvider(),
-                            $"{chasseur} veut tirer -> On tire pas quand la partie est terminée"));
+                        ;
                         _repository.Save(partieDeChasse);
 

[Survived] String mutation
Service/PartieDeChasseService.cs:114:29
                     else
                     {
                         partieDeChasse.Events.Add(new Event(_timeProvider(),
-                            $"{chasseur} veut tirer -> On tire pas quand la partie est terminée"));
+                            $""));
                         _repository.Save(partieDeChasse);
 

[Survived] Statement mutation
Service/PartieDeChasseService.cs:115:25
                     {
                         partieDeChasse.Events.Add(new Event(_timeProvider(),
                             $"{chasseur} veut tirer -> On tire pas quand la partie est terminée"));
-                        _repository.Save(partieDeChasse);
+                        ;
 
                         throw new OnTirePasQuandLaPartieEstTerminée();

[Killed] Statement mutation
Service/PartieDeChasseService.cs:117:25
                             $"{chasseur} veut tirer -> On tire pas quand la partie est terminée"));
                         _repository.Save(partieDeChasse);
 
-                        throw new OnTirePasQuandLaPartieEstTerminée();
+                        ;
                     }
                 }
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.EchoueSiLaPartieDeChasseEstTerminée

[Survived] Statement mutation
Service/PartieDeChasseService.cs:122:21
                 }
                 else
                 {
-                    partieDeChasse.Events.Add(new Event(_timeProvider(),
-                        $"{chasseur} veut tirer -> On tire pas pendant l'apéro, c'est sacré !!!"));
+                    ;
                     _repository.Save(partieDeChasse);
                     throw new OnTirePasPendantLapéroCestSacré();

[Survived] Statement mutation
Service/PartieDeChasseService.cs:124:21
                 {
                     partieDeChasse.Events.Add(new Event(_timeProvider(),
                         $"{chasseur} veut tirer -> On tire pas pendant l'apéro, c'est sacré !!!"));
-                    _repository.Save(partieDeChasse);
+                    ;
                     throw new OnTirePasPendantLapéroCestSacré();
                 }

[Killed] Statement mutation
Service/PartieDeChasseService.cs:125:21
                     partieDeChasse.Events.Add(new Event(_timeProvider(),
                         $"{chasseur} veut tirer -> On tire pas pendant l'apéro, c'est sacré !!!"));
                     _repository.Save(partieDeChasse);
-                    throw new OnTirePasPendantLapéroCestSacré();
+                    ;
                 }
             }
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.EchoueSiLesChasseursSontEnApero

[Killed] Statement mutation
Service/PartieDeChasseService.cs:130:17
             }
             else
             {
-                throw new TasTropPicoléMonVieuxTasRienTouché();
+                ;
             }
 
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TirerSurUneGalinette.EchoueCarPasDeGalinetteSurLeTerrain

[Killed] Equality mutation
Service/PartieDeChasseService.cs:145:17
                 throw new LaPartieDeChasseNexistePas();
             }
 
-            if (partieDeChasse.Status != PartieStatus.Apéro)
+            if (partieDeChasse.Status == PartieStatus.Apéro)
             {
                 if (partieDeChasse.Status != PartieStatus.Terminée)
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+Tirer.AvecUnChasseurAyantDesBalles; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+Tirer.EchoueSiLaPartieDeChasseEstTerminée; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+Tirer.EchoueSiLesChasseursSontEnApero

[Killed] Statement mutation
Service/PartieDeChasseService.cs:155:29
 
                         if (chasseurQuiTire.BallesRestantes == 0)
                         {
-                            partieDeChasse.Events.Add(new Event(_timeProvider(),
-                                $"{chasseur} tire -> T'as plus de balles mon vieux, chasse à la main"));
+                            ;
                             _repository.Save(partieDeChasse);
 
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Survived] Statement mutation
Service/PartieDeChasseService.cs:157:29
                         {
                             partieDeChasse.Events.Add(new Event(_timeProvider(),
                                 $"{chasseur} tire -> T'as plus de balles mon vieux, chasse à la main"));
-                            _repository.Save(partieDeChasse);
+                            ;
 
                             throw new TasPlusDeBallesMonVieuxChasseALaMain();

[Killed] Statement mutation
Service/PartieDeChasseService.cs:162:25
                             throw new TasPlusDeBallesMonVieuxChasseALaMain();
                         }
 
-                        partieDeChasse.Events.Add(new Event(_timeProvider(), $"{chasseur} tire"));
+                        ;
                         chasseurQuiTire.BallesRestantes--;
                     }
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Killed] Statement mutation
Service/PartieDeChasseService.cs:163:25
                         }
 
                         partieDeChasse.Events.Add(new Event(_timeProvider(), $"{chasseur} tire"));
-                        chasseurQuiTire.BallesRestantes--;
+                        ;
                     }
                     else
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+Tirer.AvecUnChasseurAyantDesBalles; Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Killed] PostDecrementExpression to PostIncrementExpression mutation
Service/PartieDeChasseService.cs:163:25
                         }
 
                         partieDeChasse.Events.Add(new Event(_timeProvider(), $"{chasseur} tire"));
-                        chasseurQuiTire.BallesRestantes--;
+                        chasseurQuiTire.BallesRestantes++;
                     }
                     else
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+Tirer.AvecUnChasseurAyantDesBalles; Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Survived] String mutation
Service/PartieDeChasseService.cs:182:21
             else
             {
                 partieDeChasse.Events.Add(new Event(_timeProvider(),
-                    $"{chasseur} veut tirer -> On tire pas pendant l'apéro, c'est sacré !!!"));
+                    $""));
                 _repository.Save(partieDeChasse);
 

[Killed] Statement mutation
Service/PartieDeChasseService.cs:185:17
                     $"{chasseur} veut tirer -> On tire pas pendant l'apéro, c'est sacré !!!"));
                 _repository.Save(partieDeChasse);
 
-                throw new OnTirePasPendantLapéroCestSacré();
+                ;
             }
 
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+Tirer.EchoueSiLesChasseursSontEnApero

[Killed] Equality mutation
Service/PartieDeChasseService.cs:200:17
                 throw new LaPartieDeChasseNexistePas();
             }
 
-            if (partieDeChasse.Status == PartieStatus.Apéro)
+            if (partieDeChasse.Status != PartieStatus.Apéro)
             {
                 throw new OnEstDéjàEnTrainDePrendreLapéro();
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+PrendreLApéro.EchoueSiLesChasseursSontDéjaEnApero; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+PrendreLApéro.QuandLaPartieEstEnCours

[Killed] Statement mutation
Service/PartieDeChasseService.cs:202:17
 
             if (partieDeChasse.Status == PartieStatus.Apéro)
             {
-                throw new OnEstDéjàEnTrainDePrendreLapéro();
+                ;
             }
             else if (partieDeChasse.Status == PartieStatus.Terminée)
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+PrendreLApéro.EchoueSiLesChasseursSontDéjaEnApero

[Killed] Equality mutation
Service/PartieDeChasseService.cs:204:22
             {
                 throw new OnEstDéjàEnTrainDePrendreLapéro();
             }
-            else if (partieDeChasse.Status == PartieStatus.Terminée)
+            else if (partieDeChasse.Status != PartieStatus.Terminée)
             {
                 throw new OnPrendPasLapéroQuandLaPartieEstTerminée();
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+PrendreLApéro.QuandLaPartieEstEnCours; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+PrendreLApéro.EchoueSiLaPartieDeChasseEstTerminée

[Killed] Statement mutation
Service/PartieDeChasseService.cs:206:17
             }
             else if (partieDeChasse.Status == PartieStatus.Terminée)
             {
-                throw new OnPrendPasLapéroQuandLaPartieEstTerminée();
+                ;
             }
             else
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+PrendreLApéro.EchoueSiLaPartieDeChasseEstTerminée

[Killed] Statement mutation
Service/PartieDeChasseService.cs:211:17
             else
             {
                 partieDeChasse.Status = PartieStatus.Apéro;
-                partieDeChasse.Events.Add(new Event(_timeProvider(), "Petit apéro"));
+                ;
                 _repository.Save(partieDeChasse);
             }
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie
