[Killed] Statement mutation
Service/PartieDeChasseService.cs:212:17
             {
                 partieDeChasse.Status = PartieStatus.Apéro;
                 partieDeChasse.Events.Add(new Event(_timeProvider(), "Petit apéro"));
-                _repository.Save(partieDeChasse);
+                ;
             }
         }
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+PrendreLApéro.QuandLaPartieEstEnCours

[Killed] Equality mutation
Service/PartieDeChasseService.cs:225:17
                 throw new LaPartieDeChasseNexistePas();
             }
 
-            if (partieDeChasse.Status == PartieStatus.EnCours)
+            if (partieDeChasse.Status != PartieStatus.EnCours)
             {
                 throw new LaChasseEstDéjàEnCours();
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+ReprendreLaPartieDeChasse.EchoueSiLaChasseEstEnCours; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+ReprendreLaPartieDeChasse.EchoueSiLaPartieDeChasseEstTerminée; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+ReprendreLaPartieDeChasse.QuandLapéroEstEnCours

[Killed] Statement mutation
Service/PartieDeChasseService.cs:227:17
 
             if (partieDeChasse.Status == PartieStatus.EnCours)
             {
-                throw new LaChasseEstDéjàEnCours();
+                ;
             }
 
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+ReprendreLaPartieDeChasse.EchoueSiLaChasseEstEnCours

[Killed] Equality mutation
Service/PartieDeChasseService.cs:230:17
                 throw new LaChasseEstDéjàEnCours();
             }
 
-            if (partieDeChasse.Status == PartieStatus.Terminée)
+            if (partieDeChasse.Status != PartieStatus.Terminée)
             {
                 throw new QuandCestFiniCestFini();
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+ReprendreLaPartieDeChasse.EchoueSiLaPartieDeChasseEstTerminée; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+ReprendreLaPartieDeChasse.QuandLapéroEstEnCours; Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Killed] Statement mutation
Service/PartieDeChasseService.cs:232:17
 
             if (partieDeChasse.Status == PartieStatus.Terminée)
             {
-                throw new QuandCestFiniCestFini();
+                ;
             }
 
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+ReprendreLaPartieDeChasse.EchoueSiLaPartieDeChasseEstTerminée

[Killed] Statement mutation
Service/PartieDeChasseService.cs:236:13
             }
 
             partieDeChasse.Status = PartieStatus.EnCours;
-            partieDeChasse.Events.Add(new Event(_timeProvider(), "Reprise de la chasse"));
+            ;
             _repository.Save(partieDeChasse);
         }
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Killed] String mutation
Service/PartieDeChasseService.cs:236:66
             }
 
             partieDeChasse.Status = PartieStatus.EnCours;
-            partieDeChasse.Events.Add(new Event(_timeProvider(), "Reprise de la chasse"));
+            partieDeChasse.Events.Add(new Event(_timeProvider(), ""));
             _repository.Save(partieDeChasse);
         }
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Killed] Statement mutation
Service/PartieDeChasseService.cs:237:13
 
             partieDeChasse.Status = PartieStatus.EnCours;
             partieDeChasse.Events.Add(new Event(_timeProvider(), "Reprise de la chasse"));
-            _repository.Save(partieDeChasse);
+            ;
         }
 
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+ReprendreLaPartieDeChasse.QuandLapéroEstEnCours

[Killed] Linq method mutation (OrderByDescending() to OrderBy())
Service/PartieDeChasseService.cs:244:30
         {
             var partieDeChasse = _repository.GetById(id);
 
-            var classement = partieDeChasse
-                .Chasseurs
-                .GroupBy(c => c.NbGalinettes)
-                .OrderByDescending(g => g.Key);
+            var classement = partieDeChasse
+                .Chasseurs
+                .GroupBy(c => c.NbGalinettes)
+                .OrderBy(g => g.Key);
 
             if (partieDeChasse.Status == PartieStatus.Terminée)
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TerminerLaPartieDeChasse.QuandLaPartieEstEnCoursEt1SeulChasseurGagne; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TerminerLaPartieDeChasse.QuandLaPartieEstEnCoursEt2ChasseursExAequo; Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Killed] Linq method mutation (All() to Any())
Service/PartieDeChasseService.cs:258:17
 
             var result = "";
 
-            if (classement.All(group => group.Key == 0))
+            if (classement.Any(group => group.Key == 0))
             {
                 result = "Brocouille";
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TerminerLaPartieDeChasse.QuandLaPartieEstEnCoursEt1SeulChasseurGagne; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TerminerLaPartieDeChasse.QuandLaPartieEstEnCoursEt2ChasseursExAequo; Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Killed] Negate expression
Service/PartieDeChasseService.cs:258:17
 
             var result = "";
 
-            if (classement.All(group => group.Key == 0))
+            if (!(classement.All(group => group.Key == 0)))
             {
                 result = "Brocouille";
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TerminerLaPartieDeChasse.QuandLaPartieEstEnCoursEt1SeulChasseurDansLaPartie; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TerminerLaPartieDeChasse.QuandLesChasseursSontALaperoEtTousExAequo; Bouchonnois.Tests.Service.PartieDeChasseServiceTests+TerminerLaPartieDeChasse.QuandLaPartieEstEnCoursEtToutLeMondeBrocouille

[Survived] Statement mutation
Service/PartieDeChasseService.cs:261:17
             if (classement.All(group => group.Key == 0))
             {
                 result = "Brocouille";
-                partieDeChasse.Events.Add(
-                    new Event(_timeProvider(), "La partie de chasse est terminée, vainqueur : Brocouille")
-                );
+                ;
             }
             else

[Survived] Linq method mutation (First() to FirstOrDefault())
Service/PartieDeChasseService.cs:267:44
             }
             else
             {
-                result = string.Join(", ", classement.First().Select(c => c.Nom));
+                result = string.Join(", ", classement.FirstOrDefault().Select(c => c.Nom));
                 partieDeChasse.Events.Add(
                     new Event(_timeProvider(),

[Killed] Statement mutation
Service/PartieDeChasseService.cs:268:17
             else
             {
                 result = string.Join(", ", classement.First().Select(c => c.Nom));
-                partieDeChasse.Events.Add(
-                    new Event(_timeProvider(),
-                        $"La partie de chasse est terminée, vainqueur : {string.Join(", ", classement.First().Select(c => $"{c.Nom} - {c.NbGalinettes} galinettes"))}"
-                    )
-                );
+                ;
             }
 
killedBy: Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie

[Survived] Linq method mutation (First() to FirstOrDefault())
Service/PartieDeChasseService.cs:270:92
                 result = string.Join(", ", classement.First().Select(c => c.Nom));
                 partieDeChasse.Events.Add(
                     new Event(_timeProvider(),
-                        $"La partie de chasse est terminée, vainqueur : {string.Join(", ", classement.First().Select(c => $"{c.Nom} - {c.NbGalinettes} galinettes"))}"
+                        $"La partie de chasse est terminée, vainqueur : {string.Join(", ", classement.FirstOrDefault().Select(c => $"{c.Nom} - {c.NbGalinettes} galinettes"))}"
                     )
                 );

[Killed] Linq method mutation (OrderByDescending() to OrderBy())
Service/PartieDeChasseService.cs:292:17
 
             return string.Join(
                 Environment.NewLine,
-                partieDeChasse.Events
-                    .OrderByDescending(@event => @event.Date)
-                    .Select(@event => @event.ToString())
+                partieDeChasse.Events
+                    .OrderBy(@event => @event.Date)
+                    .Select(@event => @event.ToString())
             );
         }
killedBy: Bouchonnois.Tests.Service.PartieDeChasseServiceTests+ConsulterStatus.QuandLaPartieEstTerminée; Bouchonnois.Tests.Service.ScenarioTests.DéroulerUnePartie
